osp/dictionaries/catalyticFoam/laminar_2D_ML/constant/solverOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.3;
    format      binary;
    class       dictionary;
    location    "constant";
    object      solverOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MachineLearning
{
	MLSurrogate   on;
	MachineLearningFile   "ml_ExtraTrees_forCFD.pkl";
}

PhysicalModel
{
	strangAlgorithm 		"TransportReactionMomentum";
	homogeneousReactions 		off;
	heterogeneousReactions 		on;

	alfaCatalyst 			1e-5;
	Sct 0.7;
	Prt 0.7;
	catalyticWalls (reactingWall);

	energyEquation			        off;
	reactionHeatFromHeterogeneousReactions  on;
	constPressureBatchReactor 	        true;
	massDiffusionInEnergyEquation	on;

	includeDpDt			off;
	soretEffect			off;
}

OdeHomogeneous
{
	odeSolver 	"OpenSMOKE";
	relTolerance 	1e-7;
	absTolerance 	1e-12;
	maximumOrder 	5;
	fullPivoting 	false;
}

OdeHeterogeneous
{
	odeSolver 	"OpenSMOKE";
	relTolerance 	1e-7;
	absTolerance 	1e-12;
	maximumOrder 	5;
	fullPivoting 	false;
}

#include "isatOptions"

LewisNumbers
{
	O2  1.0;
	H2  1.1;
	H2O 1.2;
	N2  1.3;
}

// ************************************************************************* //
