osp/dictionaries/catalyticFoam/laminar_2D_ML/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticMechanism 	"kinetic/kinetics";
inertSpecie N2;

thermoType
{
    type            hePsiThermo;

    mixture         multiComponentMixture;

    transport       sutherland;

    thermo          janaf;

    energy          sensibleEnthalpy;

    equationOfState perfectGas;

    specie          specie;
}

#include "../kinetic/kinetics/thermoOF"
