osp/dictionaries/catalyticFoam/laminar_2D_ML/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
internalFacesOnly true;

// Baffles to create.
baffles
{

	aBaffle11
	{
		//- Use predefined faceZone to select faces and orientation.
		type faceZone;
		zoneName fzsBaffle0;

		patches
		{
			master
			{
			//- Master side patch

			name baf0_half0;
			type patch;
			neighbourPatch baf0_half1;
			}
			slave
			{
			//- Slave side patch

			name baf0_half1;
			type patch;
			neighbourPatch baf0_half0;
			}
		}
	}

	aBaffle22
	{
		//- Use predefined faceZone to select faces and orientation.
		type faceZone;
		zoneName fzsBaffle10;

		patches
		{
			master
			{
			//- Master side patch

			name baf10_half10;
			type patch;
			neighbourPatch baf10_half11;
			}
			slave
			{
			//- Slave side patch

			name baf10_half11;
			type patch;
			neighbourPatch baf10_half10;
			}
		}
	}

}


// ************************************************************************* //
