osp/dictionaries/catalyticFoam/laminar_2D_ML/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0.5)
    volScalarFieldValue	CO2 1e-16
 volScalarFieldValue O2 0.2262
 volScalarFieldValue CO 0.0292
 volScalarFieldValue N2 0.7446

);

regions
(
/*    boxToCell
    {
         box (-10 -10 0) (10 10 2);
          fieldValues
          (
               volScalarFieldValue N2 0.76160300000000003
    		volScalarFieldValue H2 0.00699699999999999975
    volScalarFieldValue O2 0.231399999999999995
    volScalarFieldValue H2O 0
//	 volScalarFieldValue T 320
          );
    }*/
);




// ************************************************************************* //
